                                # Как зделать включения (List Comprehension)
                            # Включения это [] только квадратные скобки

                            # Что сделать, с чем сделать *при каком условии
numbs = [20, 50, 15]        # есть список чисел, и мы хотим отобрать только те которые больше 30
                            # Нам ужно достать какоето число 
res = [item for item in numbs if item > 30] # itev что сделать с обьектом. for iten in numbs где взять. if item > 30 и при каком
                                            # условии 
print(res)