                                            # Список list
list1 = [1,2,3,4,5]                     # list1 и в нем лежит какоето значения
list2 = list1                           # Есть второй лист и делаем копию

list1[0] = 123                          # Мы поменял значение list1 оно поменялось и во втором
list2[4] = 8

for e in list1:                         #
    print(e)                            # Печатаем list1

print()                                 # Вывод пустой строки

for e in list2:                         #
    print(e)                            # Печатаем list2

list1[0] = 123




