# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:

# 0,56 -> 11

n = float(input("Введите число:"))
# tot = 0
# while (n > 0):
i = 1
while i <= n:
    print((3+i), end=', ')
    i += 1
print("Сумма цифр равна:", i)


