// Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
// 645 -> 5
// 78 -> третьей цифры нет
// 32679 -> 6

// if(IsEqualDigils(a, b)) Console.WriteLine();

// bool IsEqualDigils(int a, int b)
// {
//     return a == b;
// }
int num =
int res =  % 10

int counter = 0
while (counter > 999)
{
    
}