double numberA = 31;
double numberB = 5;
Console.WriteLine(numberA / numberB);


// типы даных
// int - целое число
// double - вешествение числа
// string - строки
// bool (true и false) - логический тип даных истина или ложь
// + - сложения 
// - - вычитание
// / - деления
// * - умножения
// % - нахождения остатка от деления
// () - скобки

// new Random().Next(min, max) - генератор псевдо случайных цифр
// даест случайное целое число от min max-1 (причм min будет включен а max-1 всегда на иденицу меньше) [min,max-1] или [min,max]
